import React from 'react';

const Question = () => {
    return (
        <div className='container'>
                <h4>react কিভাবে কাজ করে?</h4>
                <p>আমরা জানি ব্রাউজার বিভিন্ন ধাপ পেরিয়া ডম তৈরি করে। জাভাস্ক্রিপ্ট দিতে ডম ম্যানিপুলেট করলে আবার নতুন করে ডম তৈরি হয়ে ওয়েবপেজ প্রদর্শিত হয়
কিন্তু রিঅ্যাক্ট ব্রাউজারের মতোই একটা ডম তৈরি করে যেটা মুলত জাভাস্ক্রিপ্ট অবজেক্ট। একে ভার্চুয়াল ডম বলে। যখন ইউজার রিঅ্যাক্ট অ্যাপে কোনো একশন ঘটায় তখন ভার্চুয়াল ডমে পরিবর্তন হয়। আগের ডমের সাথে নতুন ডমের তুলনা করে দেখে স্পেসেফিক ঠিক কোন পরিবর্তন করা হয়েছে। সে অনুসারে রিঅ্যাক্ট পুরো ডমটাকে রি-রেন্ডার না করে শুধুমাত্র যেই জিনিসটা চেঞ্জ হয়েছে সেটাকেই চেঞ্জ করে।এতে ব্রাউজারের অপ্রয়োজনীয় কাজ করতে হয় না বলে রিঅ্যাক্ট দ্রুত কাজ করতে পারে</p>

<h4>props state এর মধ্যে পার্থক্য কি?</h4>
<p>props এ ডাটা একটা কম্পোনেন্ট অন্য কম্পোনেন্ট এ পাঠানো যায়। কিন্তু state এ শুধু একটি কম্পোনেন্ট এর মধ্যে ব্যাবহার করা যায়

props is immutable কিন্তু state mutable .
Props are readonly আর State is both read and write</p>
        </div>
    );
};

export default Question;